prunkdump/GNUVario-TTGO-T5/Sources/Beta Code/Old/v0.7 beta 6/libraries/esp32FOTA2/src/esp32fota2.cpp
/*
   esp32 firmware OTA
   Date: December 2018
   Author: Chris Joyce <https://chrisjoyce911/esp32FOTA>
   Purpose: Perform an OTA update from a bin located on a webserver (HTTP & HTTPS)
*/

/* 
 *********************************************************************************
 *                                                                               *
 *                           esp32fota2                                          *
 *                                                                               *
 *  version    Date     Description                                              *
 *    1.0    18/01/20                                                            *
 *    1.0.1  19/01/20   Ajout execHTTPexist et execHTTPSexist					 					 *
 *    1.0.2  06/02/20   Ajout downloadWwwFiles()                                 *         
 *    1.0.3             Ajout downloadWwwFiles                                   *
 *    1.0.4  10/02/20   Ajout UpdateWwwDirectory                                 *
 *                                                                               *
 *********************************************************************************/

#include <DebugConfig.h>
#include "esp_log.h"

#include <HardwareConfig.h>

#ifdef WIFI_DEBUG
#define ARDUINOTRACE_ENABLE 1
#else
#define ARDUINOTRACE_ENABLE 0
#endif

#define ARDUINOTRACE_SERIAL SerialPort
#include <ArduinoTrace.h>

#include "esp32fota2.h"
#include "Arduino.h"
#include <WiFi.h>
#include <WiFiMulti.h>
#include <HTTPClient.h>
#include <Update.h>
#include "ArduinoJson.h"
#include <WiFiClientSecure.h>

#include <varioscreenGxEPD.h>

#ifdef HAVE_SDCARD
#include <sdcardHAL.h>
#endif

// This is the root Certificate Authority that signed
// the server certifcate for server https://github.com
/*const char* rootCACertificate = \
"-----BEGIN CERTIFICATE-----\n" \
"MIIEIzCCAwugAwIBAgIQT5Qzz46+WowBY93PLJ+8CDANBgkqhkiG9w0BAQsFADBI\n" \
"MRswGQYDVQQDExJFU0VUIFNTTCBGaWx0ZXIgQ0ExHDAaBgNVBAoTE0VTRVQsIHNw\n" \
"b2wuIHMgci4gby4xCzAJBgNVBAYTAlNLMB4XDTE4MDUwODAwMDAwMFoXDTIwMDYw\n" \
"MzEyMDAwMFowgccxHTAbBgNVBA8MFFByaXZhdGUgT3JnYW5pemF0aW9uMRMwEQYL\n" \
"KwYBBAGCNzwCAQMTAlVTMRkwFwYLKwYBBAGCNzwCAQITCERlbGF3YXJlMRAwDgYD\n" \
"VQQFEwc1MTU3NTUwMQswCQYDVQQGEwJVUzETMBEGA1UECBMKQ2FsaWZvcm5pYTEW\n" \
"MBQGA1UEBxMNU2FuIEZyYW5jaXNjbzEVMBMGA1UEChMMR2l0SHViLCBJbmMuMRMw\n" \
"EQYDVQQDEwpnaXRodWIuY29tMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKC\n" \
"AQEAw8pdTS/pX2hGcbERt1bg82rQEqQGZQLLX0iZE4xPrITjMZaAbIjHLy60+sKt\n" \
"EklH33Zln/7g8dnzyFhA03npKmJ18a3kAj3MkcEBQbh/z4s+CUZjSgjkYlXnU+sR\n" \
"lqTeRx2SvACa+RbyCQFjAVfPkx8LkdCDnzha+JwaZL6H3VsTxIIK//Nh/2NGOacg\n" \
"Y2FhDwgc2K/XxeXRlqkXy8Ej/eu+4uuF4VFcjCdm7UEUSQwuSiXi0IMl4KJqqEyk\n" \
"2qHkS8KI39qcQgqGfxoZj+7Ia2Y9I7TGVu0mrwI+NGpRt04zHR11MCjOB5ydbqRu\n" \
"WxEypDJ7q6zwTCFCsryHiFxuqQIDAQABo4GIMIGFMCUGA1UdEQQeMByCCmdpdGh1\n" \
"Yi5jb22CDnd3dy5naXRodWIuY29tMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEF\n" \
"BQcDAjAMBgNVHRMBAf8EAjAAMA4GA1UdDwEB/wQEAwIFoDAfBgNVHSMEGDAWgBRM\n" \
"CcmJdRovgGSqmdi30CucbWA/PzANBgkqhkiG9w0BAQsFAAOCAQEAEcUQF4xJ6WiV\n" \
"71AVvxIQg9GgWzXnpgpJ2ycYD70cynZFZuJ4Uj1Hn4kOEEoSRfKzGJCdQXVTuM4s\n" \
"wb6EET3zrkQdfrct5PkGAr7k+ZedBAGU+N5ci0WEfJVgK1KTjgoWOaW2sWtxkjDv\n" \
"fFBpL8JD7VIWZTgH6A7y4lQehF0VsIPKE3U9WuIckjNjL8F+9cnHn4Yr8I2qtzRz\n" \
"RL6Mkj6k3uWp6hqoBLgP3blRCnESxb7ibSZP5agLvk0O/eHixb+Jn+unroxTk1u7\n" \
"PeuGH30HmyAvHHSnrq788ODFfEKN6Xcn8Q5NbVETN9Wae35udRpL0IRR+fAKfVEj\n" \
"SEyFvvhD+w==\n" \
"-----END CERTIFICATE-----\n";*/

const char *rootCACertificate =
    "-----BEGIN CERTIFICATE-----\n"
    "MIIF6TCCA9GgAwIBAgIQBeTcO5Q4qzuFl8umoZhQ4zANBgkqhkiG9w0BAQwFADCB\n"
    "iDELMAkGA1UEBhMCVVMxEzARBgNVBAgTCk5ldyBKZXJzZXkxFDASBgNVBAcTC0pl\n"
    "cnNleSBDaXR5MR4wHAYDVQQKExVUaGUgVVNFUlRSVVNUIE5ldHdvcmsxLjAsBgNV\n"
    "BAMTJVVTRVJUcnVzdCBSU0EgQ2VydGlmaWNhdGlvbiBBdXRob3JpdHkwHhcNMTQw\n"
    "OTEyMDAwMDAwWhcNMjQwOTExMjM1OTU5WjBfMQswCQYDVQQGEwJGUjEOMAwGA1UE\n"
    "CBMFUGFyaXMxDjAMBgNVBAcTBVBhcmlzMQ4wDAYDVQQKEwVHYW5kaTEgMB4GA1UE\n"
    "AxMXR2FuZGkgU3RhbmRhcmQgU1NMIENBIDIwggEiMA0GCSqGSIb3DQEBAQUAA4IB\n"
    "DwAwggEKAoIBAQCUBC2meZV0/9UAPPWu2JSxKXzAjwsLibmCg5duNyj1ohrP0pIL\n"
    "m6jTh5RzhBCf3DXLwi2SrCG5yzv8QMHBgyHwv/j2nPqcghDA0I5O5Q1MsJFckLSk\n"
    "QFEW2uSEEi0FXKEfFxkkUap66uEHG4aNAXLy59SDIzme4OFMH2sio7QQZrDtgpbX\n"
    "bmq08j+1QvzdirWrui0dOnWbMdw+naxb00ENbLAb9Tr1eeohovj0M1JLJC0epJmx\n"
    "bUi8uBL+cnB89/sCdfSN3tbawKAyGlLfOGsuRTg/PwSWAP2h9KK71RfWJ3wbWFmV\n"
    "XooS/ZyrgT5SKEhRhWvzkbKGPym1bgNi7tYFAgMBAAGjggF1MIIBcTAfBgNVHSME\n"
    "GDAWgBRTeb9aqitKz1SA4dibwJ3ysgNmyzAdBgNVHQ4EFgQUs5Cn2MmvTs1hPJ98\n"
    "rV1/Qf1pMOowDgYDVR0PAQH/BAQDAgGGMBIGA1UdEwEB/wQIMAYBAf8CAQAwHQYD\n"
    "VR0lBBYwFAYIKwYBBQUHAwEGCCsGAQUFBwMCMCIGA1UdIAQbMBkwDQYLKwYBBAGy\n"
    "MQECAhowCAYGZ4EMAQIBMFAGA1UdHwRJMEcwRaBDoEGGP2h0dHA6Ly9jcmwudXNl\n"
    "cnRydXN0LmNvbS9VU0VSVHJ1c3RSU0FDZXJ0aWZpY2F0aW9uQXV0aG9yaXR5LmNy\n"
    "bDB2BggrBgEFBQcBAQRqMGgwPwYIKwYBBQUHMAKGM2h0dHA6Ly9jcnQudXNlcnRy\n"
    "dXN0LmNvbS9VU0VSVHJ1c3RSU0FBZGRUcnVzdENBLmNydDAlBggrBgEFBQcwAYYZ\n"
    "aHR0cDovL29jc3AudXNlcnRydXN0LmNvbTANBgkqhkiG9w0BAQwFAAOCAgEAWGf9\n"
    "crJq13xhlhl+2UNG0SZ9yFP6ZrBrLafTqlb3OojQO3LJUP33WbKqaPWMcwO7lWUX\n"
    "zi8c3ZgTopHJ7qFAbjyY1lzzsiI8Le4bpOHeICQW8owRc5E69vrOJAKHypPstLbI\n"
    "FhfFcvwnQPYT/pOmnVHvPCvYd1ebjGU6NSU2t7WKY28HJ5OxYI2A25bUeo8tqxyI\n"
    "yW5+1mUfr13KFj8oRtygNeX56eXVlogMT8a3d2dIhCe2H7Bo26y/d7CQuKLJHDJd\n"
    "ArolQ4FCR7vY4Y8MDEZf7kYzawMUgtN+zY+vkNaOJH1AQrRqahfGlZfh8jjNp+20\n"
    "J0CT33KpuMZmYzc4ZCIwojvxuch7yPspOqsactIGEk72gtQjbz7Dk+XYtsDe3CMW\n"
    "1hMwt6CaDixVBgBwAc/qOR2A24j3pSC4W/0xJmmPLQphgzpHphNULB7j7UTKvGof\n"
    "KA5R2d4On3XNDgOVyvnFqSot/kGkoUeuDcL5OWYzSlvhhChZbH2UF3bkRYKtcCD9\n"
    "0m9jqNf6oDP6N8v3smWe2lBvP+Sn845dWDKXcCMu5/3EFZucJ48y7RetWIExKREa\n"
    "m9T8bJUox04FB6b9HbwZ4ui3uRGKLXASUoWNjDNKD/yZkuBjcNqllEdjB+dYxzFf\n"
    "BT02Vf6Dsuimrdfp5gJ0iHRc2jTbkNJtUQoj1iM=\n"
    "-----END CERTIFICATE-----\n";

//************************************
esp32FOTA2::esp32FOTA2(String firwmareType, int firwmareVersion, int firwmareSubVersion, int firwmareBetaVersion)
//************************************
{
    _firwmareType = firwmareType;
    DUMP(_firwmareType);
    _firwmareVersion = firwmareVersion;
    _firwmareSubVersion = firwmareSubVersion;
    _firwmareBetaVersion = firwmareBetaVersion;
    useDeviceID = false;
}

// Utility to extract header value from headers
//************************************
String esp32FOTA2::getHeaderValue(String header, String headerName)
//************************************
{
    return header.substring(strlen(headerName.c_str()));
}

// OTA Logic
//************************************
void esp32FOTA2::execOTA()
//************************************
{

    TRACE();

    screen.ScreenViewReboot("Upgrade");

