prunkdump/GNUVario-TTGO-T5/Sources/Beta Code/Old/v0.7 beta 6/libraries/esp32FOTA2/src/esp32fota2.cpp
    WiFiClient client;
    int contentLength = 0;
    bool isValidContentType = false;

    SerialPort.println("Connecting to: " + String(_host));
    // Connect to Webserver
    //    if (client.connect(_host.c_str(), _port))

#ifdef HAVE_SDCARD
    if (NB_WWW_FILES > 0)
    {
        downloadWwwFiles();
    }
#endif

    if (client.connect(_host.c_str(), _port))
    {
        // Connection Succeed.
        // Fecthing the bin
        SerialPort.println("Fetching Bin: " + String(_bin));

        // Get the contents of the bin file
        client.print(String("GET ") + _bin + " HTTP/1.1\r\n" +
                     "Host: " + _host + "\r\n" +
                     "Cache-Control: no-cache\r\n" +
                     "Connection: close\r\n\r\n");

        unsigned long timeout = millis();
        while (client.available() == 0)
        {
            if (millis() - timeout > 5000)
            {
                SerialPort.println("Client Timeout !");
                client.stop();
                return;
            }
        }

        while (client.available())
        {
            // read line till /n
            String line = client.readStringUntil('\n');
            // remove space, to check if the line is end of headers
            line.trim();

            if (!line.length())
            {
                //headers ended
                break; // and get the OTA started
            }

            // Check if the HTTP Response is 200
            // else break and Exit Update
            if (line.startsWith("HTTP/1.1"))
            {
                SerialPort.println("HTTP LINE");
                SerialPort.println(line);
                if (line.indexOf("200") < 0)
                {
                    SerialPort.println("Got a non 200 status code from server. Exiting OTA Update.");
                    break;
                }
            }

            // extract headers here
            // Start with content length
            if (line.startsWith("Content-Length: "))
            {
                contentLength = atoi((getHeaderValue(line, "Content-Length: ")).c_str());
                SerialPort.println("Got " + String(contentLength) + " bytes from server");
            }

            // Next, the content type
            if (line.startsWith("Content-Type: "))
            {
                String contentType = getHeaderValue(line, "Content-Type: ");
                SerialPort.println("Got " + contentType + " payload.");
                if (contentType == "application/octet-stream")
                {
                    isValidContentType = true;
                }
            }
        }
    }
    else
    {
        // Connect to webserver failed
        // May be try?
        // Probably a choppy network?
#ifdef WIFI_DEBUG
        SerialPort.println("Connection to " + String(_host) + " failed. Please check your setup");
#endif
        // retry??
        // execOTA();
    }

    // Check what is the contentLength and if content type is `application/octet-stream`
#ifdef WIFI_DEBUG
    SerialPort.println("contentLength : " + String(contentLength) + ", isValidContentType : " + String(isValidContentType));
#endif

    // check contentLength and content type
    if (contentLength && isValidContentType)
    {
        // Check if there is enough to OTA Update
        bool canBegin = Update.begin(contentLength);

        // If yes, begin
        if (canBegin)
        {
#ifdef WIFI_DEBUG
            SerialPort.println("Begin OTA. This may take 2 - 5 mins to complete. Things might be quite for a while.. Patience!");
#endif
            // No activity would appear on the Serial monitor
            // So be patient. This may take 2 - 5mins to complete
            size_t written = Update.writeStream(client);

            if (written == contentLength)
            {
#ifdef WIFI_DEBUG
                SerialPort.println("Written : " + String(written) + " successfully");
#endif
            }
            else
            {
#ifdef WIFI_DEBUG
                SerialPort.println("Written only : " + String(written) + "/" + String(contentLength) + ". Retry?");
#endif
                // retry??
                // execOTA();
            }

            if (Update.end())
            {
                SerialPort.println("OTA done!");
                if (Update.isFinished())
                {
#ifdef WIFI_DEBUG
                    SerialPort.println("Update successfully completed. Rebooting.");
#endif
                    screen.ScreenViewReboot();
                    ESP.restart();
                }
                else
                {
#ifdef WIFI_DEBUG
                    SerialPort.println("Update not finished? Something went wrong!");
#endif
                }
            }
            else
            {
#ifdef WIFI_DEBUG
                SerialPort.println("Error Occurred. Error #: " + String(Update.getError()));
#endif
            }
        }
        else
        {
            // not enough space to begin OTA
            // Understand the partitions and
            // space availability
#ifdef WIFI_DEBUG
            SerialPort.println("Not enough space to begin OTA");
#endif
            client.flush();
        }
    }
    else
    {
#ifdef WIFI_DEBUG
        SerialPort.println("There was no content in the response");
#endif
        client.flush();
    }
}

//************************************
bool esp32FOTA2::execHTTPexist()
//************************************
{
    TRACE();
    String useURL;

    if (useDeviceID)
    {
        // String deviceID = getDeviceID() ;
        useURL = checkURL + "?id=" + getDeviceID();
    }
    else
    {
        useURL = checkURL;
    }

    WiFiClient client;
    _port = 80;

#ifdef WIFI_DEBUG
    SerialPort.println("Getting HTTP");
    SerialPort.println(useURL);
    SerialPort.println("------");
#endif
    if ((WiFi.status() == WL_CONNECTED))
    { //Check the current connection status

        HTTPClient http;

        http.begin(useURL);        //Specify the URL
        int httpCode = http.GET(); //Make the request

        if (httpCode > 0)
        { //Check is a file was returned

#ifdef WIFI_DEBUG
            SerialPort.printf("[HTTP] GET... code: %d\n", httpCode);
#endif

            // file found at server
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)
            {
                String payload = http.getString();
#ifdef WIFI_DEBUG
                SerialPort.println(payload);
#endif
            }

