prunkdump/GNUVario-TTGO-T5/Sources/Beta Code/Old/v0.7 beta 6/libraries/esp32FOTA2/src/esp32fota2.cpp
            http.end(); //Free the resources
            return true;
        }
        else
        {
#ifdef WIFI_DEBUG
            SerialPort.println("Error on HTTP request");
            SerialPort.printf("[HTTP] GET... failed, error: %s\n", http.errorToString(httpCode).c_str());
#endif
            http.end(); //Free the resources
            return false;
        }
    }
    return false;
}

//***********************************
bool esp32FOTA2::execHTTPSexist()
//***********************************
{

    String useURL;

    if (useDeviceID)
    {
        // String deviceID = getDeviceID() ;
        useURL = checkURL + "?id=" + getDeviceID();
    }
    else
    {
        useURL = checkURL;
    }

    WiFiClient client;
    _port = 443;

#ifdef WIFI_DEBUG
    SerialPort.println("Getting HTTPS");
    SerialPort.println(useURL);
    SerialPort.println("------");
#endif

    if ((WiFi.status() == WL_CONNECTED))
    { //Check the current connection status

        WiFiClientSecure *client = new WiFiClientSecure;
        if (!client)
        {
#ifdef WIFI_DEBUG
            SerialPort.println("Unable to create client");
#endif
            return false;
        }

        client->setCACert(rootCACertificate);

        HTTPClient https;

        https.begin(*client, useURL); //Specify the URL
        int httpCode = https.GET();   //Make the request

        if (httpCode > 0)
        { //Check is a file was returned

#ifdef WIFI_DEBUG
            SerialPort.printf("[HTTPS] GET... code: %d\n", httpCode);
#endif

            // file found at server
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)
            {
                String payload = https.getString();
                SerialPort.println(payload);
            }

            https.end(); //Free the resources
            return true;
        }
        else
        {
#ifdef WIFI_DEBUG
            SerialPort.println("Error on HTTP request");
            SerialPort.printf("[HTTPS] GET... failed, error: %s\n", https.errorToString(httpCode).c_str());
#endif
            https.end(); //Free the resources
            return false;
        }
    }
    return false;
}

//************************************
uint8_t esp32FOTA2::execHTTPcheck(bool betaVersion)
//************************************
{
    TRACE();
    String useURL;

    if (useDeviceID)
    {
        // String deviceID = getDeviceID() ;
        useURL = checkURL + "?id=" + getDeviceID();
    }
    else
    {
        useURL = checkURL;
    }

    WiFiClient client;
    _port = 80;

#ifdef WIFI_DEBUG
    SerialPort.println("Getting HTTP");
    SerialPort.println(useURL);
    SerialPort.println("------");
#endif
    if ((WiFi.status() == WL_CONNECTED))
    { //Check the current connection status

        HTTPClient http;

        http.begin(useURL);        //Specify the URL
        int httpCode = http.GET(); //Make the request

        if (httpCode == 200)
        { //Check is a file was returned

            String payload = http.getString();

            int str_len = payload.length() + 1;
            char JSONMessage[str_len];
            payload.toCharArray(JSONMessage, str_len);

#ifdef WIFI_DEBUG
            SerialPort.print("Parsing size : ");
            SerialPort.println(str_len);
            //SerialPort.println(JSONMessage);
#endif

            StaticJsonDocument<1300> JSONDocument; //Memory pool
            DeserializationError err = deserializeJson(JSONDocument, JSONMessage);

            if (err)
            { //Check for errors in parsing
#ifdef WIFI_DEBUG
                SerialPort.println("Parsing failed");
#endif
                delay(5000);
                return MAJ_ERROR;
            }

            String tmp;
            tmp = _firwmareType;
            if (betaVersion)
                tmp = tmp + "b";
#ifdef WIFI_DEBUG
            SerialPort.print("Update Firmware : ");
            SerialPort.println(tmp);
#endif

            if (JSONDocument.containsKey(tmp))
            {
                JsonObject JSONDocumentUpdate = JSONDocument[tmp];

                //const char *pltype = JSONDocument["type"];
                int plversion = JSONDocumentUpdate["version"];
                UpdateVersion = plversion;

                int plsubversion = JSONDocumentUpdate["subversion"];
                UpdateSubVersion = plsubversion;

                int plbetaversion = JSONDocumentUpdate["betaversion"];
                UpdateBetaVersion = plbetaversion;

                const char *plhost = JSONDocumentUpdate["host"];
                _port = JSONDocumentUpdate["port"];

                if (JSONDocumentUpdate.containsKey("www"))
                {

#ifdef WIFI_DEBUG
                    SerialPort.println("la section du fichier json contient la clé www");
#endif
                    JsonArray myArray = JSONDocumentUpdate["www"].as<JsonArray>();

                    for (JsonVariant myValue : myArray)
                    {
#ifdef WIFI_DEBUG
                        Serial.println(myValue.as<char *>());
#endif
                        _wwwfiles[NB_WWW_FILES] = myValue.as<char *>();
                        NB_WWW_FILES++;
                    }
                }
                else
                {
                    NB_WWW_FILES = 0;
                }

#ifdef WIFI_DEBUG
                SerialPort.print("Version : ");
                SerialPort.println(plversion);

                SerialPort.print("Sub Version : ");
                SerialPort.println(plsubversion);

                SerialPort.print("Beta Version : ");
                SerialPort.println(plbetaversion);

                SerialPort.print("Port : ");
                SerialPort.println(_port);
#endif

                const char *plbin = JSONDocumentUpdate["bin"];

                String jshost(plhost);
                String jsbin(plbin);

                _host = jshost;
                _bin = jsbin;

#ifdef WIFI_DEBUG
                SerialPort.print("Host : ");
                SerialPort.println(_host);

                SerialPort.print("Bin : ");
                SerialPort.println(_bin);

                SerialPort.print("Firmware Version : ");
                SerialPort.println(_firwmareVersion);

                SerialPort.print("Firmware Sub Version : ");
                SerialPort.println(_firwmareSubVersion);

                SerialPort.print("Firmware Beta Version : ");
                SerialPort.println(_firwmareBetaVersion);
#endif

                if (plversion > _firwmareVersion)
                {
                    http.end(); //Free the resources
                    return MAJ_AVAILABLE;
                }
                else if ((plversion == _firwmareVersion) && (plsubversion > _firwmareSubVersion))
                {
                    http.end(); //Free the resources
                    return MAJ_AVAILABLE;
                }
                else if ((plversion == _firwmareVersion) && (plsubversion == _firwmareSubVersion) && (plbetaversion > _firwmareBetaVersion))
                {
                    //ce cas ne match que pour les beta
                    http.end(); //Free the resources
                    return MAJ_AVAILABLE;
                }

                else
                {
#ifdef WIFI_DEBUG
                    SerialPort.println("MAJ MAJ_NOTAVAILABLE");
#endif
                    http.end(); //Free the resources
                    return MAJ_NOTAVAILABLE;
                }
            }
            else
            {
#ifdef WIFI_DEBUG
                if (betaVersion)
                {
                    SerialPort.println("Erreur info firmware non trouvé dans la beta");
                }
                else
                {
                    SerialPort.println("Erreur info firmware non trouvé dans la non beta");
                }
#endif
                http.end(); //Free the resources
                return MAJ_ERROR;
            }
        }

        else
        {
#ifdef WIFI_DEBUG
            SerialPort.println("Error on HTTP request");
#endif
            http.end(); //Free the resources
            return MAJ_ERROR;
        }

