prunkdump/GNUVario-TTGO-T5/Sources/Beta Code/Old/v0.7 beta 6/libraries/esp32FOTA2/src/esp32fota2.cpp
        http.end(); //Free the resources
        return MAJ_ERROR;
    }
    return MAJ_ERROR;
}

//************************************
uint8_t esp32FOTA2::execHTTPScheck(bool betaVersion)
//************************************
{

    String useURL;

    if (useDeviceID)
    {
        // String deviceID = getDeviceID() ;
        useURL = checkURL + "?id=" + getDeviceID();
    }
    else
    {
        useURL = checkURL;
    }

    WiFiClient client;
    _port = 443;

#ifdef WIFI_DEBUG
    SerialPort.println("Getting HTTPS");
    SerialPort.println(useURL);
    SerialPort.println("------");
#endif

    if ((WiFi.status() == WL_CONNECTED))
    { //Check the current connection status

        WiFiClientSecure *client = new WiFiClientSecure;
        if (!client)
        {
#ifdef WIFI_DEBUG
            SerialPort.println("Unable to create client");
#endif
            return false;
        }
        client->setCACert(rootCACertificate);

        HTTPClient https;

        https.begin(*client, useURL); //Specify the URL
        int httpCode = https.GET();   //Make the request

        if (httpCode == 200)
        { //Check is a file was returned

            String payload = https.getString();

            int str_len = payload.length() + 1;
            char JSONMessage[str_len];
            payload.toCharArray(JSONMessage, str_len);

            StaticJsonDocument<1300> JSONDocument; //Memory pool
            DeserializationError err = deserializeJson(JSONDocument, JSONMessage);

            if (err)
            { //Check for errors in parsing
#ifdef WIFI_DEBUG
                SerialPort.println("Parsing failed");
#endif
                delay(5000);
                return false;
            }

            const char *pltype = JSONDocument["type"];
            int plversion = JSONDocument["version"];
            const char *plhost = JSONDocument["host"];
            _port = JSONDocument["port"];
            const char *plbin = JSONDocument["bin"];

            String jshost(plhost);
            String jsbin(plbin);

            _host = jshost;
            _bin = jsbin;

            String fwtype(pltype);

            if (plversion > _firwmareVersion && fwtype == _firwmareType)
            {
                return true;
            }
            else
            {
                return false;
            }
        }

        else
        {
#ifdef WIFI_DEBUG
            SerialPort.println("Error on HTTP request");
#endif
            return false;
        }

        https.end(); //Free the resources
        return false;
    }
    return false;
}

//************************************
String esp32FOTA2::getDeviceID()
//************************************
{
    char deviceid[21];
    uint64_t chipid;
    chipid = ESP.getEfuseMac();
    sprintf(deviceid, "%" PRIu64, chipid);
    String thisID(deviceid);
    return thisID;
}

// Force a firmware update regartless on current version
//************************************
bool esp32FOTA2::forceUpdate(String firwmareHost, int firwmarePort, String firwmarePath)
//************************************
{
    _host = firwmareHost;
    _bin = firwmarePath;
    _port = firwmarePort;
    execOTA();

    return true;
}

//************************************
String esp32FOTA2::getHTTPVersion()
//************************************
{
    TRACE();
    String output;

    output = "{\n";

    output += "\"Firmware\":{\n";
    output += "\"type\": " + String(VARIOSCREEN_SIZE) + ",\n";
    output += "\"version\": " + String(_firwmareVersion) + ",\n";
    output += "\"subversion\": " + String(_firwmareSubVersion) + ",\n";
    output += "\"betaversion\": " + String(_firwmareBetaVersion) + "\n}";

    int8_t updatedNeeded = execHTTPcheck(false);

    if (updatedNeeded >= 0)
    {
#ifdef WIFI_DEBUG
        SerialPort.println("************** Version Stable : Mise à jour disponible *****************");
        SerialPort.println(updatedNeeded);
        SerialPort.print("Version : ");
        SerialPort.print(UpdateVersion);
        SerialPort.print(".");
        SerialPort.println(UpdateSubVersion);
#endif

        output += ",\n\"" + _firwmareType + "\":{\n";
        output += "\"type\": " + String(VARIOSCREEN_SIZE) + ",\n";
        output += "\"version\": " + String(UpdateVersion) + ",\n";
        output += "\"subversion\": " + String(UpdateSubVersion) + ",\n";
        output += "\"betaversion\": 0\n}";
    }

    updatedNeeded = execHTTPcheck(true);
    if (updatedNeeded >= 0)
    {
#ifdef WIFI_DEBUG
        SerialPort.println("***************** Version Beta : Mise à jour disponible *********************");
        SerialPort.print("Version : ");
        SerialPort.print(UpdateVersion);
        SerialPort.print(".");
        SerialPort.print(UpdateSubVersion);
        SerialPort.print("b");
        SerialPort.println(UpdateBetaVersion);
#endif

        output += ",\n\"" + _firwmareType + "b\":{\n";
        output += "\"type\": " + String(VARIOSCREEN_SIZE) + ",\n";
        output += "\"version\": " + String(UpdateVersion) + ",\n";
        output += "\"subversion\": " + String(UpdateSubVersion) + ",\n";
        output += "\"betaversion\": " + String(UpdateBetaVersion) + "\n}";
    }

    output += "\n}";

    return output;
}

//************************************
void esp32FOTA2::downloadWwwFiles()
//************************************
{
    TRACE();

#ifdef WIFI_DEBUG
    SerialPort.println("[HTTP] Debut méthode downloadWwwFiles");
#endif
    // File system object.
    // Directory file.
    SdFile root;

    String newPath = "wwwnew";
    if (!SDHAL_SD.mkdir(newPath.c_str()))
    {
#ifdef WIFI_DEBUG
        SerialPort.println("[HTTP] Impossible de créer le répertoire wwwnew");
#endif
        return;
    }

    uint8_t i;

    for (i = 0; i < NB_WWW_FILES; i++)
    {
        //telechargement des fichiers 1 par un
        HTTPClient http;
        String myfilename = newPath + "/" + _wwwfiles[i].substring(_wwwfiles[i].lastIndexOf("/") + 1);
        http.begin(_host.c_str(), _port, _wwwfiles[i]);

        // start connection and send HTTP header
        int httpCode = http.GET();
        if (httpCode > 0)
        {
            // HTTP header has been send and Server response header has been handled
#ifdef WIFI_DEBUG
            SerialPort.println("[HTTP] GET... code: " + String(httpCode));
#endif

            // file found at server
            if (httpCode == HTTP_CODE_OK)
            {

                SdFile myFile;
                boolean tmpReturn = false;
                tmpReturn = myFile.open(myfilename.c_str(), O_WRONLY | O_CREAT);

