prunkdump/GNUVario-TTGO-T5/Sources/Beta Code/Old/v0.7 beta 6/libraries/esp32FOTA2/src/esp32fota2.cpp
                if (!tmpReturn)
                {
#ifdef WIFI_DEBUG
                    SerialPort.print("Impossible de créer le fichier : ");
                    SerialPort.println(myfilename);
#endif
                    return;
                }

#ifdef WIFI_DEBUG
                SerialPort.print("[HTTP] Début écriture");
                SerialPort.println(myfilename);
#endif
                // get lenght of document (is -1 when Server sends no Content-Length header)
                int len = http.getSize();

                // create buffer for read
                uint8_t buff[128] = {0};

                // get tcp stream
                WiFiClient *stream = http.getStreamPtr();

                // read all data from server
                while (http.connected() && (len > 0 || len == -1))
                {
                    // get available data size
                    size_t size = stream->available();

                    if (size)
                    {
                        // read up to 128 byte
                        int c = stream->readBytes(buff, ((size > sizeof(buff)) ? sizeof(buff) : size));

                        // ICI l'ecriture dans le fichier
                        //USE_SERIAL.write(buff, c);
                        myFile.write(buff, c);
                        myFile.flush();

                        if (len > 0)
                        {
                            len -= c;
                        }
                    }
                    delay(1);
                }

                myFile.close();
#ifdef WIFI_DEBUG
                SerialPort.print("[HTTP] Fin écriture");
                SerialPort.println(myfilename);
#endif

#ifdef WIFI_DEBUG
                SerialPort.println("[HTTP] connection closed or file end.");
#endif
            }
        }
        else
        {
#ifdef WIFI_DEBUG
            SerialPort.println("[HTTP] GET... failed, error:" + String(http.errorToString(httpCode).c_str()));
#endif
        }

        http.end();
    }
}

//************************************
bool esp32FOTA2::UpdateWwwDirectory()
//************************************
{
	
	TRACE();

#ifdef WIFI_DEBUG
  SerialPort.println("[HTTP] Debut méthode updateWwwDirectory");
#endif
    // File system object.
    // Directory file.
    SdFile root;

    String newPath = "wwwnew";
//		String oldPath = "";
    DUMP(newPath.c_str());
    if (SDHAL_SD.exists(newPath.c_str()))
    {
#ifdef WIFI_DEBUG
      SerialPort.println("[HTTP] le dossier wwwnew existe");
#endif

		// Traitement du fichier wwwnew

      newPath = "wwwold";
      if (SDHAL_SD.exists(newPath.c_str()))
      {
#ifdef WIFI_DEBUG
        SerialPort.println("[HTTP] le dossier wwwold existe");
#endif

				SdFile root;
				SdFile file;

				if (!root.open("wwwold")) {
#ifdef WIFI_DEBUG
					SerialPort.println("[HTTP] impossible d'ouvrir le dossier wwwold");
#endif
          return false;
				}
				// Open next file in root.
				// Warning, openNext starts at the current directory position
				// so a rewind of the directory may be required.
				while (file.openNext(&root, O_RDONLY)) {

					char fBuffer[32];
					file.getName(fBuffer, 30);
					String SBuffer = "wwwold/";
					SBuffer += String(fBuffer);

#ifdef WIFI_DEBUG
					SerialPort.print("[HTTP] suppression du fichier : ");
					SerialPort.println(SBuffer);
#endif

					file.close();
		
				  if (!SDHAL_SD.remove(SBuffer.c_str())) {
#ifdef WIFI_DEBUG
						SerialPort.println("[HTTP] le fichier n'a pas pu être supprimé");
#endif
			    }
				}
				
			//Effacement du repertoire wwwold
			
			  if (!SDHAL_SD.rmdir(newPath.c_str())) {
#ifdef WIFI_DEBUG
			    SerialPort.println("[HTTP] le dossier wwwold n'a pas pu être supprimé");
#endif
				  return false;   //Pas de mise à jour
			  }
		  }

      // rename "www" into "wwwold"
		  if (!SDHAL_SD.rename("www", "wwwold")) {
#ifdef WIFI_DEBUG
				SerialPort.println("[HTTP] le dossier www ne peut être renomé en wwwold");
#endif
				return false;   //Pas de mise à jour
      }

      // rename "www" into "wwwold"
		  if (!SDHAL_SD.rename("wwwnew", "www")) {
#ifdef WIFI_DEBUG
				SerialPort.println("[HTTP] le dossier wwwnew ne peut être renomé en www");
#endif
				return false;   //Pas de mise à jour
      }
			
			return true; // Mise à jour site web OK
	  }
  else
	  {
#ifdef WIFI_DEBUG
		   SerialPort.println("[HTTP] le dossier wwwnew n'existe pas");
#endif
			 return false;   //Pas de mise à jour
		}
  return false;   //Pas de mise à jour
}

/*{
  "Gnuvario154":{
    "version": 0,
		"subversion": 7,
		"betaversion": 0,
    "host": "gnuvario-e.yj.fr",
    "port": 80,
    "bin": "/update/Gnuvario154.bin"
	},
  "Gnuvario154b":{
    "version": 0,
		"subversion": 7,
		"betaversion": 8,
    "host": "gnuvario-e.yj.fr",
    "port": 80,
    "bin": "/update/Gnuvario154b.bin"
	},*/

//************************************
String esp32FOTA2::getHTTPSVersion()
//************************************
{
    String output;
    return output;
}
